tutorials/compressible/rhoPimpleFoam/RAS/annularThermalMixer/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces
(
    "AMI.obj"
    "shaft.obj"
    "wall.obj"
    "statorBlades.obj"
    "rotorBlades.obj"
);

includedAngle   150;  // Identifes a feature when angle
                      // between faces < includedAngle
trimFeatures
{
    minElem         10;   // minimum edges within a feature
}

writeObj        yes;  // writes out _edgeMesh.obj files to view features

// ************************************************************************* //
